
"""
Реалізуйте алгоритм сортування обміном (бульбашкове сортування).
"""

N = 5000     # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    arr_len = len(array)
    for i in range(arr_len, 0, -1):
        for j in range(1, i):
            if array[j - 1] > array[j]:
                # array[j], array[j-1] = array[j-1], array[j]
                array[j-1], array[j] = array[j], array[j-1]

