from t2_10 import f

def g(n):
    sum = 0  # O(1)

    # Зовнішній цикл виконується n разів
    for i in range(1, n + 1):
        # Виклик f(i) займає O(n) операцій.
        # В сумі це дає 1 + 2 + ... + n операцій.
        sum = sum + i + f(i)  # O(n) на кожній ітерації         f(i) = i * (i + 1)//2
                                                                            #         i + f(i) = (i**2 +3i)\2

    return sum  # O(1)
# Що звгалом є O(n**2). Що капець як погано

#А то оптимізована функція
def g_optimized(n):
    return (n * (n + 1) * (2 * n + 1) // 12) + (3 * n * (n + 1) // 4) #А це буде O(1)