import sys
sys.set_int_max_str_digits(2000000) #Так як числа у нас на вході дуже великі, треба зняти обмеження з пітона

"""
Ми ж знаєм шо алгоритм карацуби для великих чисел, тому я взяв на себе сміливість зробити відхід
 від алгоритма карацуби коли маємо справу з досить малими числами.
 (це можна змінювати за константною змінною RECURSIVE_STOP
 
 Також юзаємо двійкові операції, бо операції над рядками будуть
  капець як сповільнювати наш алгоритм
"""
RECURSIVE_STOP = 2048

def karatsuba_speedup(x: int, y: int) -> int:
    # Тут нам краще обмежити рекурсію, бо вона дуже сповільнює справу
    if x < RECURSIVE_STOP or y < RECURSIVE_STOP:
        return x * y

    # Знаходимо півдовжину в бітах
    m = max(x.bit_length(), y.bit_length()) // 2

    # Розділяєм на кускі необхідні нашому алгоритму шляхом маск і зсувів
    mask = (1 << m) - 1 #Такою во махінацією робимо маску вигляду "00001111" Або подібного треба для розбиття чисел навпів

    a = x & mask  # Права частина. тут во будуть стояти 1 (можливо, негарантоовано)  тільки на правих m-позиціях
    b = x >> m  # Ліва частина. тута те само тільки зліва

    c = y & mask #Те само для другого числоа
    d = y >> m

    # Рекурсимо
    z0 = karatsuba_speedup(a, c) #Тепер виконуємо три множнння як в алгоритмі
    z1 = karatsuba_speedup(a + b, c + d)
    z2 = karatsuba_speedup(b, d)

    # Збираємо результат побітовими зсувами (додаєм (віднімаєм) наші три добутки)
    # І того маєм наш алг карацуби x * y = ac·10^(2n) + (ad + bc)·10^n + bd
    return (z2 << (2 * m)) + ((z1 - z2 - z0) << m) + z0

###########################################################


A, B = [int(i) for i in input().split()]
print(karatsuba_speedup(A, B))

#Надіюсь тут достатньо зрозуміло :)